/********************************************************************************************************************************************
*                                                                                                                                           *
*              ---------------------------------以下是模块的修改记录区-----------------------------------------                             *
*                                                                                                                                           *
********************************************************************************************************************************************/
/**********************************************
 * 内容：
 * 日期：2023-03-22
 * 作者：YJX
 * 版本号：V1.0（初版）
 ***********************************************
 * 修改内容：
 * 修改日期：
 * 修改作者：
 * 版本号：
 ***********************************************
*/
/********************************************************************************************************************************************
*                                                                                                                                           *
*                ---------------------------------以下是模块的使用说明区-----------------------------------------                           *
*                                                                                                                                           *
********************************************************************************************************************************************/
/*                                       特点说明：
          
*/
#include "ProHeadFile.h"
/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下模块间的对接函数区-----------------------------------------                             *
*                                                                                                                                           *
********************************************************************************************************************************************/
// #define Http_String_STRIsSame2(SP1,SP2,N)         FUN_String_STRIsSame2(SP1,SP2,N)
// #define Http_String_Split2(DP,DL,FP,FL,IP,IL)     FUN_String_Split2(DP,DL,FP,FL,IP,IL)
// #define Http_String_StrLink3(SP,SL,DP,DLP)        FUN_String_StrLink3(SP,SL,DP,DLP)
// #define Http_String_Ltrim(P)                      FUN_String_Ltrim(P)
// #define Http_String_S32ToStr(N,SP,SL)             FUN_String_S32ToStr(N,SP,SL)
#define NbnsS_String_StrLen(SP)                    FUN_String_StrLen(SP)
// #define Http_String_StrToS32(SP,NP)               FUN_String_StrToS32(SP,NP)
// #define Http_String_CharToHexStr(N,P)             FUN_String_CharToHexStr(N,P)
// //
// #define HttpServer_Match_Config(P)                FUN_Match_Config(P)
// #define HttpServer_Match_Process(MP,DP,DL,PP)     FUN_Match_Process(MP,DP,DL,PP)

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块间的变量申明区--------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块内的宏定义区------------------------------------                                  *
*                                                                                                                                           *
********************************************************************************************************************************************/
//
#define NBNSServer_TTL        ((u32)600)  //存活时间，单位秒
/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块内的变量类型定义区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/
typedef struct
{
//NBNS协议头数据
     u16 Tid;            //传输ID
     u16 Flags;          //协议标志
     u16 QuestN;         //问题信息数
     u16 AnswerN;        //回答信息数
     u16 AuthorityN;     //权威信息数
     u16 AdditionalN;    //附加信息数
//NBNS内容部分数据
     u16 NType;          //域名类型
     u16 NClass;         //域名种类
}NBNSHeaderType;


/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的内部函数申明区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/
static s16 NBNSServer_DomainNameEncode(u8 *dnp,u8 *dp,u8 dl);

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块内的 变量 与 宏定义 申明区--------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的系统函数代码区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/
/*-------------------------------------------------
函数名: FUN1_NBNSServer_Config
功   能: NBNS Server配置
参   数:
       NbnsServerCNFType *tp：配置结构体指针
返回值:
       等于0:配置成功
       小于0:配置失败
注   意:
       
示   例:
作   者:YJX
版   本:V1.0
时   间:2023-03-22   
-------------------------------------------------*/
s8 FUN1_NBNSServer_Config(NbnsServerCNFType *tp)
{     
     s16 s16temp;
     //域名预处理
     s16temp = NBNSServer_DomainNameEncode(tp->dnp,tp->op->DomainNameCode,(DomainNameMaxSize * 2 + 3));
     if(s16temp <= 0)
     {//编码出错--有可能域名过长
          return -1;
     }
     tp->op->DomainNameSize = (u8)s16temp;//保存有效字节数
     //保存获取IP的回调函数指针
     tp->op->GetIP = tp->GetIP;
     //

     return 0;
}

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的用户函数代码区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/
/*-------------------------------------------------
函数名: FUN1_NBNSServer_Process
功   能: NBNSServer数据处理
参   数:
       NbnsServerOPRType *tp：结构体对象指针
       u8 *dp: 待处理数据首地址
       u16 dl: 待处理数据字节数
       u16 *pn：已处理字节数
       u8 *rp: 响应数据空间首地址
       u16 *rl: (输入)响应数据空间字节数，(输出)响应数据有效字节数
返回值:
       大于0：数据不够
       等于0:处理成功
       小于0:处理失败
注   意:
       【1】、待处理的字节数为一个UDP报文的完整数据（NBNS协议一个完整的报文数据）--->50字节
       【2】、如果提供的空间足够，则接口支持【出入同缓存】
示   例:
作   者:YJX
版   本:V1.0
时   间:2023-03-22   
-------------------------------------------------*/
s8 FUN1_NBNSServer_Process(NbnsServerOPRType *tp,u8 *dp,u16 dl,u16 *pn,u8 *rp,u16 *rl)
{
     u8 u8ip[DomainNameMaxIP << 2];//相当于乘4用于存放IP地址
     u16 u16i,u16rw,u16temp;
     u16 rmaxsize = *rl;//暂存存放空间字节数
     NBNSHeaderType qhd;

     *rl = 0;//生成字节数
     *pn = 0;//已处理字节数

     if(dl < 50)
     {//数据不够
          // PRO_Test_WriteDebugInf_Str("【1】、数据不够，【");
          // PRO_Test_WriteDebugInf_Num(dl,0);
          // PRO_Test_WriteDebugInf_Str("】个\r\n");
          *pn = dl;
          return 1;
     }

     *pn = 50;//按50字节处理
     //提取NBNS请求的头数据
     qhd.Tid = (dp[0] * (u16)256 + dp[1]);
     qhd.Flags = (dp[2] * (u16)256 + dp[3]);
     qhd.QuestN = (dp[4] * (u16)256 + dp[5]);
     qhd.AnswerN = (dp[6] * (u16)256 + dp[7]);
     qhd.AuthorityN = (dp[8] * (u16)256 + dp[9]);
     qhd.AdditionalN = (dp[10] * (u16)256 + dp[11]);
     //判断请求头信息
     if(((qhd.Flags & 0xffef) != 0x0100) || (qhd.QuestN != 1) || (qhd.AnswerN) || (qhd.AuthorityN) || (qhd.AdditionalN))
     {//支持的解码格式不对
          // PRO_Test_WriteDebugInf_Str("【-1】、格式不对\r\n");
          return -1;
     }
     //判断域名编码长度
     if(dp[12] != 0x20)
     {//域名编码长度 非法
          // PRO_Test_WriteDebugInf_Str("【-2】、长度非法\r\n");
          return -2;
     }
     //判断域名是否为本模块域名
     u16rw = 13;
     for(u16i = 0;u16i < (dp[12] - 2);u16i++)//域名的最后一个不比较
     {
          if(dp[u16rw++] != tp->DomainNameCode[u16i])
          {//不是本模块域名
               // PRO_Test_WriteDebugInf_Str("【-3】、域名不对：第【");
               // PRO_Test_WriteDebugInf_Num(u16i,0);
               // PRO_Test_WriteDebugInf_Str("】个  ");
               // PRO_Test_WriteDebugInf_Str(tp->DomainNameCode);//(&dp[13]);
               // PRO_Test_WriteDebugInf_Str("\r\n");
               return -3;
          }
     }
     tp->DomainNameCode[u16i] = dp[u16rw++];//保存域名的最后一个
     tp->DomainNameCode[u16i] = dp[u16rw++];//保存域名的最后一个
     //
     if(dp[u16rw++] != '\0')
     {//不是结束符
          // PRO_Test_WriteDebugInf_Str("【-4】、结束符不对\r\n");
          return -4;
     }
     //提取域名类型 和 种类
     qhd.NType = (dp[u16rw] * (u16)256 + dp[u16rw + 1]);
     qhd.NClass = (dp[u16rw + 2] * (u16)256 + dp[u16rw + 3]);
     //判断类型 和 种类
     if((qhd.NType != 0x0020) || (qhd.NClass != 0x0001))
     {//类型 和 种类出错
          // PRO_Test_WriteDebugInf_Str("【-5】、种类类型不对\r\n");
          return -5;
     }
//---------至此，可以确认是查询本模块，开始组织应答数据---------------
     if(rmaxsize < 62)//此处先算返回1个IP所需的空间
     {//应答空间不够
          // PRO_Test_WriteDebugInf_Str("【-6】、空间不够\r\n");
          return -6;
     }
     u16rw = 0;
     //组织响应头
     rp[u16rw++] = (u8)(qhd.Tid >> 8);//传输ID
     rp[u16rw++] = (u8)(qhd.Tid);//传输ID
     rp[u16rw++] = 0x85;//Flags
     rp[u16rw++] = 0x00;//Flags
     rp[u16rw++] = 0x00;//Question
     rp[u16rw++] = 0x00;//Question
     rp[u16rw++] = 0x00;//Answer
     rp[u16rw++] = 0x01;//Answer
     rp[u16rw++] = 0x00;//Authority
     rp[u16rw++] = 0x00;//Authority
     rp[u16rw++] = 0x00;//Additional
     rp[u16rw++] = 0x00;//Additional
     //组织域名编码
     rp[u16rw++] = 0x20;//域名长度
     for(u16i = 0;u16i < 0x20;u16i++)
     {
          rp[u16rw++] = tp->DomainNameCode[u16i];
     }
     rp[u16rw++] = '\0';//结束符
     //组织类型
     rp[u16rw++] = 0x00;
     rp[u16rw++] = 0x20;//NType
     rp[u16rw++] = 0x00;
     rp[u16rw++] = 0x01;//NClass
     //组织时效数据，单位秒
     rp[u16rw++] = (u8)(NBNSServer_TTL >> 24);
     rp[u16rw++] = (u8)(NBNSServer_TTL >> 16);
     rp[u16rw++] = (u8)(NBNSServer_TTL >> 8);
     rp[u16rw++] = (u8)(NBNSServer_TTL);
     //获取IP地址
     u16temp = (DomainNameMaxIP << 2);//相当于乘4
     tp->GetIP(u8ip,&u16temp);
     u16temp >>= 2;//除4，算出有多少个IP
     if(u16temp == 0)
     {
          // PRO_Test_WriteDebugInf_Str("【-7】、IP地址获取失败\r\n");
          return -7;
     }
     if(rmaxsize < (u16temp * 6 + 56))
     {//空间不够
          // PRO_Test_WriteDebugInf_Str("【-8】、多个IP地址空间不够\r\n");
          return -8;
     }
     u16i = (u16temp * 6);//乘6每个IP需要有6个字节
     //组织IP数据长度
     rp[u16rw++] = (u8)(u16i >> 8);
     rp[u16rw++] = (u8)(u16i);
     //
     for(u16i = 0;u16i < u16temp;u16i++)
     {
          //组织IP标志信息
          rp[u16rw++] = 0x00;
          rp[u16rw++] = 0x04;
          //存放IP
          rp[u16rw++] = u8ip[u16i * 4 + 0];
          rp[u16rw++] = u8ip[u16i * 4 + 1];
          rp[u16rw++] = u8ip[u16i * 4 + 2];
          rp[u16rw++] = u8ip[u16i * 4 + 3];
          
     }
     //修改响应有效字节数     
     *rl = (u16rw);//生成字节数
     return 0;
}

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的内部函数代码区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/
//域名编码(*dnp:域名指针  *dp:编码后存放空间首地址 dl:存放空间的有效字节数)
//返回值   大于0:表示编码成功(有效字节数，不含\0) 小于0:表示编码失败
//编码规则：一个字节分成高低4位的2部分，每部分都按低4位和'A'相加，生成一个新的字节数据
static s16 NBNSServer_DomainNameEncode(u8 *dnp,u8 *dp,u8 dl)
{
     u8 u8i,u8w;
     u8 nnd[DomainNameMaxSize + 1];
     u32 u32temp;

     u32temp = NbnsS_String_StrLen(dnp);
     if(u32temp > DomainNameMaxSize)
     {//域名过长
          return -1;
     }
     //重新组织名称数据
     u8w = 1;
     for(u8i = 0;u8i < (DomainNameMaxSize + 1);u8i++)
     {
          nnd[u8i] = 0x20;
          if(u8w)
          {
               if(dnp[u8i] != '\0')
               {
                    nnd[u8i] = dnp[u8i];
               }
               else
               {
                    u8w = 0;
               }             
          }
     }
     //将重新组织的名称进行编码
     u8w = 0;
     for(u8i = 0;u8i < (DomainNameMaxSize + 1);u8i++)
     {
          dp[u8w++] = (((nnd[u8i] & 0xf0) >> 4) + 'A');
          dp[u8w++] = ((nnd[u8i] & 0x0f) + 'A');
     }
     dp[u8w] = '\0';
     //返回有效字节数，不含\0
     return u8w;
}
