/********************************************************************************************************************************************
*                                                                                                                                           *
*              ---------------------------------以下是模块的修改记录区-----------------------------------------                             *
*                                                                                                                                           *
********************************************************************************************************************************************/
/**********************************************
 * 内容：
 * 日期：2023-06-05
 * 作者：YJX
 * 版本号：V1.0（初版）
 ***********************************************
 * 修改内容：
 * 修改日期：
 * 修改作者：
 * 版本号：
 ***********************************************
*/
/********************************************************************************************************************************************
*                                                                                                                                           *
*                ---------------------------------以下是模块的使用说明区-----------------------------------------                           *
*                                                                                                                                           *
********************************************************************************************************************************************/
/*                                       特点说明：
          DNS服务器，仅支持1个问题，响应1个答案，使用IPV4的服务
*/
#include "FUN_String.h"
// #include "FUN_Match.h"
#include "FUN1_DNS.h"
/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下模块间的对接函数区-----------------------------------------                             *
*                                                                                                                                           *
********************************************************************************************************************************************/
// #define SNMP_S32ToStr(N,P,L)                 FUN_String_S32ToStr(N,P,L)
// #define SNMP_StrLen(SP)                      FUN_String_StrLen(SP)
#define DNS_StrIsRame(P1,P2)                FUN_String_STRIsSame(P1,P2)
// #define SNMP_StrToS32(SP,NP)                 FUN_String_StrToS32(SP,NP)
// //
// #define SNMP_MIBConfig(T)                    FUN_Match_Config(T)
// #define SNMP_MIBMatch(T,P,L,PP)              FUN_Match_Process(T,P,L,PP)
// #define DNS_DebugINFSend(P,L)                     //调试信息输出
/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块间的变量申明区--------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块内的宏定义区------------------------------------                                  *
*                                                                                                                                           *
********************************************************************************************************************************************/

// //
// #define SNMP_VersionNum                 1    //SNMP版本号(1:V1)
// //解码错误值宏定义
// #define SNMP_DecodeErr_DataType         -40  //数据类型异常
// #define SNMP_DecodeErr_DataSizeMax      -41  //数据量过大
// #define SNMP_DecodeErr_DataSizeLess     -42  //数据量不够
/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块内的变量类型定义区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/
typedef struct
{
//DNS协议头数据
     u16 Tid;            //传输ID
     u16 Flags;          //协议标志
     u16 QuestN;         //问题信息数
     u16 AnswerN;        //回答信息数
     u16 AuthorityN;     //权威信息数
     u16 AdditionalN;    //附加信息数
//DNS内容部分数据
     u16 NType;          //域名类型
     u16 NClass;         //域名种类
}DNSHeaderType;

// typedef struct
// {
//      u8 datatype;//数据类型,用于保存响应的数据类型
//      u8 oid[SNMP_MaxOIDSize];
//      u16 oidl; //oid缓存字节数，处理后返回有效字节数，不含\0
//      u8 value[SNMP_MaxValueSize];
//      u16 valuel;//value缓存字节数，处理后返回有效字节数，不含\0
// }OIDV;

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的内部函数申明区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块内的 变量 与 宏定义 申明区--------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的系统函数代码区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/
/*-------------------------------------------------
函数名: FUN1_DNS_Config
功   能: DNS配置
参   数:
       
返回值:
       等于0:配置成功
       小于0:配置失败
注   意:
       
示   例:
作   者:YJX
版   本:V1.0
时   间:2023-06-06   
-------------------------------------------------*/
s8 FUN1_DNS_Config(DNSServerCNFType *tp)
{
     tp->op->dnsmp = tp->dnsmp;
     //此处对输入的地址映射表合法性进行判断
     //检查域名段数 及 总长度。

     return 0;
}

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的用户函数代码区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/
/*-------------------------------------------------
函数名: FUN1_DNS_Process
功   能: DNS数据处理
参   数:
       u8 *dp: 待处理数据首地址
       u16 dl: 待处理数据字节数
       u16 *pn：已处理字节数
       u8 *rp: 响应数据空间首地址
       u16 *rl: (输入)响应数据空间字节数，(输出)响应数据有效字节数
返回值:
       大于0：数据不够
       等于0:处理成功
       小于0:处理失败
注   意:
       【1】、待处理的字节数为一个UDP报文的完整数据（DNS协议一个完整的报文数据）最大576字节，一般在512字节
       【2】、如果提供的空间足够，则接口支持【出入同缓存】
       【3】、目前仅支持一个问题，一个回答
示   例:
作   者:YJX
版   本:V1.0
时   间:2023-06-06   
-------------------------------------------------*/
s8 FUN1_DNS_Process(DNSServerOPRType *bp,u8 *dp,u16 dl,u16 *pn,u8 *rp,u16 *rl)
{
     u8 u8i,u8j,u8temp;//     
     u8 doname[MaxDonameSize];
     u16 u16pi;//处理索引号
     u16 u16writenameintex;//保存域名索引号
     u16 rmaxsize = *rl;//暂存存放空间字节数
     u16 u16i,u16ipintex;//IP串索引号
     DNSHeaderType qhd;//请求头数据结构体

     *rl = 0;//生成字节数
     *pn = 0;//已处理字节数
     if(dl <= 16)
     {
          *pn = dl;
          return 1;//数据不够
     }

     //---------- 
     *pn = dl;
     //提取DNS请求的头数据
     qhd.Tid = (dp[0] * (u16)256 + dp[1]);
     qhd.Flags = (dp[2] * (u16)256 + dp[3]);
     qhd.QuestN = (dp[4] * (u16)256 + dp[5]);
     qhd.AnswerN = (dp[6] * (u16)256 + dp[7]);
     qhd.AuthorityN = (dp[8] * (u16)256 + dp[9]);
     qhd.AdditionalN = (dp[10] * (u16)256 + dp[11]);
     //判断请求头信息
     if(((qhd.Flags & 0xffef) != 0x0100) || (qhd.QuestN != 1) || (qhd.AnswerN) || (qhd.AuthorityN) || (qhd.AdditionalN))
     {//支持的解码格式不对
          // PRO_Test_WriteDebugInf_Str("【-1】、格式不对\r\n");
          return -1;
     }

     //提取域名 到 doname
     u16pi = 12;//处理数据索引号从12开始
     u16writenameintex = 0;
     for(u8i = 0;u8i < MaxDonameSecNum;u8i++)
     {
          u8temp = dp[u16pi++];//获取第一段域名字节数
          if((dl - 12 - u8i - u16writenameintex) < u8temp)
          {//如果数据不够
               return 2;
          }
          if((u16writenameintex + u8temp + 1) > MaxDonameSize)
          {//域名长度越界了
               return -2;
          }
          for(u8j = 0;u8j < u8temp;u8j++)
          {
               doname[u16writenameintex++] = dp[u16pi++];
          }
          //预判下一个域名段信息
          if(dp[u16pi])
          {//还有信息
               if((u8i + 1) >= MaxDonameSecNum)
               {//域名段数越界了
                    return -3;
               }
               doname[u16writenameintex++] = '.';
          }
          else
          {//没有了
               doname[u16writenameintex++] = dp[u16pi++];
               break;//退出循环
          }
     }

     //判断剩余数据是否够
     if(dl < (u16pi + 4))
     {//数据不够
          return 3;
     }
     *pn = (u16pi + 4);//更新正确的处理字节数

     //提取域名类型
     qhd.NType = (dp[u16pi] * (u16)256 + dp[u16pi + 1]);
     //提取域名类
     qhd.NClass = (dp[u16pi + 2] * (u16)256 + dp[u16pi + 3]);
     //判断
     if((qhd.NType != 1) || (qhd.NClass != 1))
     {//查询类型 和 类不支持
          return -4;
     }

     //查询IP，并组织响应数据
     for(u16ipintex = 0;u16ipintex < U16MAZVALUE;u16ipintex++)
     {
          if(bp->dnsmp[u16ipintex].dnp == (u8 *)0)
          {//都没匹配到，则统一返回默认IP串
               break;
          }
          else if(DNS_StrIsRame(bp->dnsmp[u16ipintex].dnp,doname) == 0)
          {//匹配到域名
               break;
          }
     }
     
     
     //此处只返回1个IP地址，故比原数据多出了16字节的数据     
     if(rmaxsize < (*pn + 16))
     {//应答存放空间不够
          return -5;
     }

     //组织应答数据----原数据信息
     for(u16i = 0;u16i < *pn;u16i++)
     {
          rp[u16i] = dp[u16i];
     }
     //修改flag
     rp[2] = 0x81;
     rp[3] = 0x80;
     //修改Answer的个数（大端格式）
     rp[6] = 0x00;
     rp[7] = 0x01;//只有一个应答
     //新添加具体的应答内容
     rp[u16i++] = 0xc0;//固定是0xc0
     rp[u16i++] = 0x0c;//第1个域名偏移12个字节
     rp[u16i++] = 0x00;
     rp[u16i++] = 0x01;//类型为IPV4（大端格式）
     rp[u16i++] = 0x00;
     rp[u16i++] = 0x01;//类为因特网IP（大端格式）
     rp[u16i++] = 0x00;
     rp[u16i++] = 0x00;
     rp[u16i++] = 0x01;//0x02;
     rp[u16i++] = 0x2c;///0x3d;//TTL为573（9分33秒）（大端格式）
     rp[u16i++] = 0x00;
     rp[u16i++] = 0x04;//后面IP地址数据长度为4个字节（大端格式）
     rp[u16i++] = bp->dnsmp[u16ipintex].ipp[0];//(u8)(bp->dnsmp[u16ipintex].ip >> 24);
     rp[u16i++] = bp->dnsmp[u16ipintex].ipp[1];//(u8)(bp->dnsmp[u16ipintex].ip >> 16);
     rp[u16i++] = bp->dnsmp[u16ipintex].ipp[2];//(u8)(bp->dnsmp[u16ipintex].ip >> 8);
     rp[u16i++] = bp->dnsmp[u16ipintex].ipp[3];//(u8)(bp->dnsmp[u16ipintex].ip >> 0);

     *rl = (*pn + 16);//更新应答数据的字节数

     return 0;
}

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的内部函数代码区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/
