/********************************************************************************************************************************************
*                                                                                                                                           *
*              ---------------------------------以下是模块的修改记录区-----------------------------------------                             *
*                                                                                                                                           *
********************************************************************************************************************************************/
/**********************************************
 * 内容：
 * 日期：2020-03-18
 * 作者：YJX
 * 版本号：V1.0（初版）
 ***********************************************
 * 修改内容：增加了FUN_DataProcess_HexStrToChar
 * 修改日期：20201207
 * 修改作者：
 * 版 本 号：V2.0
 ***********************************************
*/
/********************************************************************************************************************************************
*                                                                                                                                           *
*                ---------------------------------以下是模块的使用说明区-----------------------------------------                           *
*                                                                                                                                           *
********************************************************************************************************************************************/
/*                                       特点说明：

*/
#include "FUN_DataProcess.h"
/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下模块的对接函数区-----------------------------------------                             *
*                                                                                                                                           *
********************************************************************************************************************************************/

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的宏定义区------------------------------------                                  *
*                                                                                                                                           *
********************************************************************************************************************************************/

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的变量类型定义区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的内部函数申明区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/


/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的变量申明和宏定义区--------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的系统函数代码区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的用户函数代码区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/
/*-------------------------------------------------
函数名:FUN_DataProcess_STRIsSame
功   能:比较字符串是否一样 函数
参   数:
       u8 *dp1:被比较字符串首地址
       u8 *dp2:比较字符串首地址
       u8 dl:比较的长度
返回值:
       0:一样 
      -1:不一样
注   意:
       dp1必需是字符串，且是以\0结尾的
示   例:
作   者:YJX
版   本:V1.1
时   间:2021-02-19
-------------------------------------------------*/
s8 FUN_DataProcess_STRIsSame(u8 *dp1,u8 *dp2,u8 dl)
{
     u8 u8intex;
     for(u8intex = 0;u8intex < dl;u8intex++)
     {
          if(dp1[u8intex] != dp2[u8intex])
          {
               return -1;
          }
          else if(dp1[u8intex] == '\0')
          {//被比较源数据提前结束
               return -1;
          }
     }
     if((dp1[u8intex] != '\0') || (dp2[u8intex] != '\0'))
     {//被比较源数据还没有结束
          return -1;
     }
     return 0;
}

/*-------------------------------------------------
函数名:FUN_DataProcess_StrLeng
功   能:计算字符串字节数 函数
参   数:
       u8 *sp:字符串首地址
返回值:
       字节数(不包含\0)
注   意:
       sp必需是字符串，且是以\0结尾的，且小于250个字符
示   例:
作   者:YJX
版   本:V1.0
时   间:2020-08-27
-------------------------------------------------*/
u8 FUN_DataProcess_StrLen(u8 *sp)
{
     u8 u8intex;
     for(u8intex = 0;u8intex < 250;u8intex++)
     {
          if(sp[u8intex] == '\0')
          {
               return u8intex;
          }
     }
     return 0;
}

/*-------------------------------------------------
函数名:FUN_DataProcess_StrCopy
功   能:字符串srp 拷贝 到sdp的 函数
参   数:
       u8 *sdp:字符串首地址
       u8 sdl:sdp空间字节数
       u8 *srp:字符串首地址
返回值:
       无
注   意:
       srp必需是字符串，且是以\0结尾的
       sdp拷贝结束后肯定是以\0结尾的
示   例:
作   者:YJX
版   本:V1.0
时   间:2020-08-27
-------------------------------------------------*/
void FUN_DataProcess_StrCopy(u8 *sdp,u8 sdl,u8 *srp)
{
     u8 u8intex;
     u8 u8ms = (sdl - 1);
     for(u8intex = 0;u8intex < u8ms;u8intex++)
     {
          sdp[u8intex] = srp[u8intex];
          if(sdp[u8intex] == '\0')
          {
               break;
          }
     }
     if(u8intex == u8ms)
     {
          sdp[u8intex] = '\0';
     }
}

/*-------------------------------------------------
函数名:FUN_DataProcess_HexStrToChar
功   能:十六进制字符 转 数值 函数
参   数:
       u8 *hstp:待转换字符的首地址
       u8 *rv:转换后数值保存的地址
返回值:
       0:转换成功
   小于0:转换失败
注   意:
       u8 *hstp所指向的数据字节数固定为2
示   例:
     如输入"3e"，则返回62
作   者:YJX
版   本:V1.0
时   间:2020-12-07
-------------------------------------------------*/
s8 FUN_DataProcess_HexStrToChar(u8 *hstp,u8 *rv)
{
     u8 u8intex,u8result = 0;
     for(u8intex = 0;u8intex < 2;u8intex++)
     {
          u8result <<= 4;
          if((hstp[u8intex] >= '0') && (hstp[u8intex] <= '9'))
          {               
               u8result += (hstp[u8intex] - '0');
          }
          else if((hstp[u8intex] >= 'A') && (hstp[u8intex] <= 'F'))
          {
               u8result += (hstp[u8intex] - 'A' + 10);
          }
          else if((hstp[u8intex] >= 'a') && (hstp[u8intex] <= 'f'))
          {
               u8result += (hstp[u8intex] - 'a' + 10);
          }
          else
          {
               return -1;
          }
     }
     *rv = u8result;
     return 0;
}

/*-------------------------------------------------
函数名:FUN_DataProcess_CharToHexStr
功   能:数值 转十六进制字符 函数
参   数:
       u8 hex:待转换的数值
       u8 *sp:转换结果存放首地址
返回值:
       无
注   意:
       
示   例:
     如hex=0x3e  则sp[0] = '3' sp[1] = 'E'
作   者:YJX
版   本:V1.0
时   间:2020-08-27
-------------------------------------------------*/
void FUN_DataProcess_CharToHexStr(u8 hex,u8 *sp)
{
     u8 u8temp;
     //处理高4位
     u8temp = (hex >> 4);
     sp[0] = (u8temp + '0');
     if(u8temp >= 10)
     {
          sp[0] = (u8temp - 10 + 'A');
     }
     //处理低4位
     u8temp = (hex & 0x0f);
     sp[1] = (u8temp + '0');
     if(u8temp >= 10)
     {
          sp[1] = (u8temp - 10 + 'A');
     }
}

/*-------------------------------------------------
函数名:FUN_DataProcess_StrToS32
功   能:字符串 转 数值 函数
参   数:
       u8 *sp:待转换字符串首地址
       s32 *n:转换后返回的值
返回值:
       小于0:转换失败
       大等于0:转换成功
注   意:
       
示   例:
     如"1234" 转后 就是1234
作   者:YJX
版   本:V1.0
时   间:2020-08-27
-------------------------------------------------*/
s8 FUN_DataProcess_StrToS32(u8 *sp,s32 *n)
{
     u8 u8intex;
     s8 fh = 0;
     s32 s32result = 0;
     for(u8intex = 0;u8intex < 31;u8intex++)
     {
          if(sp[u8intex] == '\0')
          {//结束
               *n = (s32result * fh);
               return 0;
          }
          else if((sp[u8intex] == '-') && (u8intex == 0))
          {
               fh = -1;//是负数
          }
          else if((sp[u8intex] == '+') && (u8intex == 0))
          {
               fh = 1;//是正数
          }
          else if((sp[u8intex] < '0') || (sp[u8intex] > '9'))
          {//非法字符
               return -1;
          }
          else
          {
               if(fh == 0)
               {
                    fh = 1;//是正数
               }
               s32result = (s32result * 10 + sp[u8intex] - '0');
          }          
     }
     //位数大等于31位
     return -1;
}

/*-------------------------------------------------
函数名:FUN_DataProcess_SmallToS32
功   能:小端4字节 转 数值 函数
参   数:
       u8 *sp:小端4字节数据首地址
返回值:
       转换后的数值
注   意:
       
示   例:
     
作   者:YJX
版   本:V1.0
时   间:2020-11-05
-------------------------------------------------*/
s32 FUN_DataProcess_SmallToS32(u8 *sp)
{
     s32 s32temp = 0;
     s32temp = sp[3];
     s32temp <<= 8;
     s32temp += sp[2];
     s32temp <<= 8;
     s32temp += sp[1];
     s32temp <<= 8;
     s32temp += sp[0];
     return s32temp;
}

/*-------------------------------------------------
函数名:FUN_DataProcess_S32ToStr
功   能:数值 转 字符串 函数
参   数:
       s32 n:待转换数据
       u8 *sp:转换后存放空间的首地址
       u8 sl:存放空间字节数
返回值:
       小于0:转换失败
       大等于0:转换成功
注   意:
       输出字符串是以\0结尾
示   例:
     如-1234 转后 就是"-1234"
作   者:YJX
版   本:V1.0
时   间:2020-08-27
-------------------------------------------------*/
s8 FUN_DataProcess_S32ToStr(s32 n,u8 *sp,u8 sl)
{
     u8 sarr[12],u8intex,u8temp,weishu = 0;
     s32 ntemp = n;
     if(n == 0)
     {
          sp[0] = '0';
          sp[1] = '\0';
          return 0;
     }
     if(n < 0)
     {
          ntemp = (0 - ntemp);//转为正数
     }
     for(u8intex = 0;u8intex < 12;u8intex++)
     {
          if(ntemp)
          {//还有数值
               sarr[u8intex] = ((ntemp % 10) + '0');
               ntemp /= 10;
          }
          else
          {
               weishu = u8intex;
               break;//结束了
          }
     }
     //判断存放空间是否足够
     if(((n < 0) && (sl < (weishu + 2))) || (sl < (weishu + 1)))
     {//如果是负数 且//加上负号和\0这两字节 或 如果是正数/加上\0这个字节
          return -1;//空间不够
     }     
     u8temp = 0;
     if(n < 0)
     {
          sp[u8temp++] = '-';
     }
     for(u8intex = 0;u8intex < weishu;u8intex++)
     {
          sp[u8temp++] = sarr[weishu - u8intex - 1];
     }
     sp[u8temp] = '\0';
     return 0;
}

/*-------------------------------------------------
函数名:FUN_DataProcess_S32ToStr
功   能:数值 转 字符串 函数
参   数:
       float fn:待转换数据
       u8 *sp:转换后存放空间的首地址
       u8 sl:存放空间字节数
返回值:
       小于0:转换失败
       大等于0:转换成功
注   意:
       输出字符串以\0结尾
示   例:
     只识别到小数点后3位
     如-12.3456 转后 就是"-12.345"
作   者:YJX
版   本:V1.0
时   间:2020-08-27
-------------------------------------------------*/
s8 FUN_DataProcess_FloatToStr(float fn,u8 *sp,u8 sl)
{
     float ftemp = (fn * 1000);//先乘1000
     s32 s32temp = (s32)ftemp;//再强制转为整型
     u8 strdata[16],u8num,u8intex,u8j;
     if(FUN_DataProcess_S32ToStr(s32temp,strdata,16) < 0)//整型转为字符串
     {//转换失败
          return -1;
     }
     u8num = FUN_DataProcess_StrLen(strdata);
     if(sl < (u8num + 3))//加3表示增加一个小数点和一个\0 还有 可能小数点在首位时，需要另外增加一个0
     {//空间不够
          return -2;
     }

     if(u8num < 3)
     {
          if(u8num == 1)
          {
               if(sl < (u8num + 5))//加3表示增加一个小数点和一个\0 还有 可能小数点在首位时，需要另外增加一个0
               {//空间不够
                    return -2;
               }
               strdata[2] = strdata[0];
               strdata[0] = '0';
               strdata[1] = '0';//补2个0
          }
          else
          {
               if(sl < (u8num + 4))//加3表示增加一个小数点和一个\0 还有 可能小数点在首位时，需要另外增加一个0
               {//空间不够
                    return -2;
               }
               strdata[2] = strdata[1];
               strdata[1] = strdata[0];
               strdata[0] = '0';//补1个0
          }
          strdata[3] = '\0';
          u8num = 3;
     }
     
     
     u8j = 0;
     for(u8intex = 0;u8intex < u8num;u8intex++)
     {
          if(u8intex == (u8num - 3))
          {
               if(u8intex == 0)
               {//小数点在首位，则添加'0'
                    sp[u8j++] = '0';
               }
               sp[u8j++] = '.';//在字符串相应位置增加小数点
          }
          sp[u8j++] = strdata[u8intex];
     }
     sp[u8j++] = '\0';
     return 0;
}

/*-------------------------------------------------
函数名:FUN_DataProcess_StrToFloat
功   能:字符串 转 浮点型 函数
参   数:
       u8 *sp:待转换字符串首地址
       float *fn:转换后返回的值
返回值:
       小于0:转换失败
       大等于0:转换成功
注   意:
       
示   例:
     只识别到小数点后3位
     如"-12.3456" 转后 就是-12.345
作   者:YJX
版   本:V1.0
时   间:2020-08-27
-------------------------------------------------*/
s8 FUN_DataProcess_StrToFloat(u8 *sp,float *fn)
{
     u8 u8intex;
     s8 fh = 0;
     s8 pointi = -1;//小数点索引号位置
     s32 s32result = 0;
     for(u8intex = 0;u8intex < 31;u8intex++)
     {
          if(pointi >= 0)
          {//如果有出现过小数点
               pointi++;//用于结果除于10的pointi次方
          }
          
          if(sp[u8intex] == '\0')
          {//结束
               s32result = (s32result * fh);
               if(pointi)
               {//可能不带小数点，也可能带小数点
                    *fn = (float)s32result;
                    if(pointi > 0)
                    {//出现了小数点
                         pointi--;//扣除结束符的1次计数
                         for(u8intex = 0;u8intex < pointi;u8intex++)
                         {
                              //以下3.3和2.3这两个数除于10.0会比较特殊，其他正常
                              //3.3 / 10.0计算结果会等于0.329
                              //2.3 / 10.0计算结果会等于0.229                              
                              *fn = (*fn / 10.0);
                         }
                    }
                    return 0;
               }
               return -1;
          }
          else if((sp[u8intex] == '-') && (u8intex == 0))
          {
               fh = -1;//是负数
          }
          else if((sp[u8intex] == '+') && (u8intex == 0))
          {
               fh = 1;//是正数
          }
          else if((sp[u8intex] == '.') && (u8intex != 0) && (pointi < 0))
          {//找到小数点
               pointi = 0;
          }
          else if((sp[u8intex] < '0') || (sp[u8intex] > '9'))
          {//非法字符
               return -1;
          }
          else
          {
               if(fh == 0)
               {
                    fh = 1;//是正数
               }
               s32result = (s32result * 10 + sp[u8intex] - '0');
          }           
     }
     //位数大等于31位
     return -1;
}

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的内部函数代码区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/


