/********************************************************************************************************************************************
*                                                                                                                                           *
*              ---------------------------------以下是模块的修改记录区-----------------------------------------                             *
*                                                                                                                                           *
********************************************************************************************************************************************/
/**********************************************
 * 内  容：
 * 日  期：2023-03-04
 * 作  者：YJX
 * 版本号：V1.0（初版）
 ***********************************************
 * 修改内容：
 * 修改日期：
 * 修改作者：
 * 版 本 号：
 ***********************************************
*/
/********************************************************************************************************************************************
*                                                                                                                                           *
*                ---------------------------------以下是模块的使用说明区-----------------------------------------                           *
*                                                                                                                                           *
********************************************************************************************************************************************/
/*                                       特点说明：
     数据配对比较模块
【1】、关键数据共4个，其中3个为结束符(0x00,0x0d,0x0a)，其中1个为设置符('=')
【2】、设置符为设置操作用来设置【命令】和【数值】的
【3】、完整的命令由【数据】+【结束符】 或 【数据】+【设置符】+【结束符】构成的
【4】、模块从第1个非关键数据起识别 到 【结束符】止，识别为完整的命令
【5】、当输入的数据未被识别为完整命令时，一律返回0即【非完整命令】
【6】、当输入的数据被识别为完整命令时，当返回正数时，表示在命令列表中找到匹配命令
       该数值表示完整的有效命令的字节数，便于其他模块使用。
【7】、当输入的数据被识别为完整命令时，当返回负数时，表示无法在命令列表中匹配到命令
       即非法命令，该数值表示完整的非法命令的字节数。
【8】、有效命令被识别后，会执行对应的【回调函数】。
【9】、当完整的命令带有【设置符】时，【回调函数】的输入参数为所携带的数据。如：
       SET_IPAddress=192.168.1.1，数据结尾以【结束符】结尾。则【命令】部分为SET_IPAddress，【数值】部分为192.168.1.1
【10】、【命令】、【数值】部分可以使用其他非关键字的252种数据。
【11】、命令列表中的命令也是需要以【结束符】来结束的
【12】、【回调函数】形式说明：
        void CmdFun_TESTT(u8 flag,u8 *dp,u8 dl)为【回调函数】
        如果flag非0表示为等号后面的数据，数据首地址在*dp，数据字节数为dl;
        如果flag为0表示无等号
【13】、初始化举例
        static CMDLISTTYPE CLTMap[] = 
{
     {"+OK",     CmdFun_OKAck    },//应答OK
     {"AT+TESTT",CmdFun_TESTT    },
};
        FUN_CmdMatch_Config(CLTMap,sizeof(CLTMap) / sizeof(CMDLISTTYPE));

例子：
待处理数据{0x0d,'A','b',0x00}，数据命令:Ab，返回+4
待处理数据{0x00,'A','b',0x0a}，数据命令:Ab，返回+4
待处理数据{0x0a,'A','b',0x0a}，数据命令:Ab，返回+4
待处理数据{0x0d,'A','b','=',0x00}，数据命令:Ab，返回-5
待处理数据{0x0d,'A','b','=','1'0x00}，数据命令:Ab，设置值:1,返回+6
待处理数据{'=','A','b','=','1'0x00}，数据命令:未知，设置值:未知,返回-6
待处理数据{0x0d,'A','b','=','1'0x00}，数据命令:Ab，设置值1,返回+6



*/
#include "FUN_Match.h"
/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下模块间的对接函数区-----------------------------------------                             *
*                                                                                                                                           *
********************************************************************************************************************************************/

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块间的变量申明区--------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块内的宏定义区------------------------------------                                  *
*                                                                                                                                           *
********************************************************************************************************************************************/
// #define CMDMAXNUM        100  //最大支持命令条数(1~255)
// #define CMDMAXLEN        255  //单命令部分最长字节数(不包括值部分)(不可更改)

// #define FULLENDDATA1     0x00 //完整结束符1
// #define FULLENDDATA2     0x0d //完整结束符2
// #define FULLENDDATA3     0x0a //完整结束符3

// #define CMDVALUEFG       '='  //命令和值的设置符
#define WAITFIND         -1   //待寻找标志
/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块内的变量类型定义区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的内部函数申明区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块内的 变量 与 宏定义 申明区--------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/
// static CMDLISTTYPE *Cltp;//命令类型列表指针
// static u8 CmdNum;//命令条数
// static u8 CmdByteNum[CMDMAXNUM];//各条命令的字节数
// static u8 CmdValueSet;//命令和值设置符
/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的系统函数代码区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/
/*-------------------------------------------------
函数名: FUN_Match_Config
功   能: 命令配对初始化
参   数:
       MatchCNFType *mctp:配置类型指针
返回值:
       0:初始化成功
   小于0:初始化失败
注   意:
       MatchTableType *mttp指向的列表中，最后一条的回调函数必须为0，用于表结束
示   例:
作   者:YJX
版   本:V1.0
时   间:2023-03-04
-------------------------------------------------*/
s8 FUN_Match_Config(MatchCNFType *mctp)
{
     u8 u8intex1,u8intex2,u8temp;
     MatchTableType *mttp;
     u16 u16intex1,u16intex2;
//
     mctp->motp->EnableFlag = 0;//设置为不可用(如果下面配置都OK，则改为可用)     
     mctp->motp->cmdnum = 0;
//-----判断结束值 和 设置值的个数
     if((mctp->EndValueNum == 0) || (mctp->EndValueNum > EndSetValueMaxNum) || (mctp->SetValueNum > EndSetValueMaxNum))
     {
          return -1;
     }
//------判断结束值 和 设置值不能一样
     for(u8intex1 = 0;u8intex1 < mctp->SetValueNum;u8intex1++)
     {
          for(u8intex2 = 0;u8intex2 < mctp->EndValueNum;u8intex2++)
          {
               if(mctp->SetValue[u8intex1] == mctp->EndValue[u8intex2])
               {//设置值 和 结束值 一样
                    return -2;
               }
          }
     }
//----- 结束值 参数保存
     mctp->motp->EndValueNum = mctp->EndValueNum;
     for(u8intex1 = 0;u8intex1 < mctp->EndValueNum;u8intex1++)
     {
          mctp->motp->EndValue[u8intex1] = mctp->EndValue[u8intex1];
     }     
//----- 设置值 参数保存
     mctp->motp->SetValueNum = mctp->SetValueNum;
     for(u8intex1 = 0;u8intex1 < mctp->SetValueNum;u8intex1++)
     {
          mctp->motp->SetValue[u8intex1] = mctp->SetValue[u8intex1];
     }   
//----- 匹配表处理
     mctp->motp->mttp = mctp->mttp;//匹配表指针保存
     mttp = mctp->mttp;//另存，便于书写和理解
     for(u16intex1 = 0;u16intex1 < U16MAZVALUE;u16intex1++)
     {
          if(mttp[u16intex1].Fp)
          {//如果回调函数 有值
               //判断匹配数据的结束，并计算出匹配字节数
               mttp[u16intex1].cmdl = 0;
               for(u16intex2 = 0;u16intex2 < U16MAZVALUE;u16intex2++)
               {
                    u8temp = mttp[u16intex1].cmdp[u16intex2];//分别取出并暂存匹配数据
                    //寻找结束值
                    for(u8intex1 = 0;u8intex1 < mctp->motp->EndValueNum;u8intex1++)
                    {
                         if(u8temp == mctp->motp->EndValue[u8intex1])
                         {//是结束值
                              break;//退出本级循环
                         }
                    }
                    if(u8intex1 >= mctp->motp->EndValueNum)
                    {//u8temp 不是结束值
                         mttp[u16intex1].cmdl++;//字节数加1
                    }
                    else
                    {//u8temp 是结束值
                         break;//退出本级循环
                    }
               }
               if(u16intex2 == U16MAZVALUE)
               {//本条匹配数据未找到结束值  非法
                    return -3;
               }
          }
          else
          {//回调函数无值
               break;//结束循环
          }
          (mctp->motp->cmdnum)++;//合法的匹配条数加1
     }
//----- 判断匹配条数
     if(mctp->motp->cmdnum == 0)
     {
          return -4;
     }
//--------------
     mctp->motp->EnableFlag = 1;//设置为 可用
     return 0;
}

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的用户函数代码区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/
/*-------------------------------------------------
函数名: FUN_CmdMatch_MatchProcess
功   能: 命令配对处理
参   数:
       MatchOPRType *motp:匹配结构体指针
       u8 *cdp:待配对处理数据首地址指针
       u16 cdl:待配对处理数据的字节数
       void *pp：回调函数形参的预留指针
返回值:
   小于0:非法命令的完整字节数
       0:数据不完整(未找到以00 或 0d 或 0a) 或 待配对处理数据字节数为0
   大于0:有效命令的完整字节数
注   意:
       
示   例:
作   者:YJX
版   本:V1.0
时   间:2023-03-04
-------------------------------------------------*/
s16 FUN_Match_Process(MatchOPRType *motp,u8 *cdp,u16 cdl,void *pp)
{
     u8 u8cmdlen,u8datintex;
     u8 *cp;
     u8 fgnum;
     u8 *vdp;
     u16 vdl;
     s16 fstartintex,fgintex,fendintex,s16intex;
//-----判断使能标志
     if(motp->EnableFlag == 0)
     {//使能标志为0
          return 0;
     }     

//进行初步处理和筛选
     fstartintex = WAITFIND;
     fgintex = WAITFIND;
     fendintex = WAITFIND;
     fgnum = 0;//设置符个数
     for(s16intex = 0;s16intex < cdl;s16intex++)
     {
          for(u8datintex = 0;u8datintex < motp->SetValueNum;u8datintex++)
          {
               if(cdp[s16intex] == motp->SetValue[u8datintex])
               {//如果是设置
                    fgintex = s16intex;
                    fgnum++;
               }
          }
          
          for(u8datintex = 0;u8datintex < motp->EndValueNum;u8datintex++)
          {
               if(cdp[s16intex] == motp->EndValue[u8datintex])
               {
                    break;
               }
          }  

          if(fstartintex == WAITFIND)
          {//待寻找有效起始索引号               
               if(u8datintex >= motp->EndValueNum)
               {//找到起始索引号
                    fstartintex = s16intex;
               }
          }
          else
          {//寻找结束的索引号
               if(u8datintex < motp->EndValueNum)
               {//找到结束索引号
                    fendintex = s16intex;   
                    break;//退出
               }
          }
     }

     if((fstartintex == WAITFIND) || (fendintex == WAITFIND))
     {//不完整
          return 0;//数据不完整
     }

     u8cmdlen = (fendintex - fstartintex);//命令长度
     if(fgnum)
     {//存在设置符
          if((fgintex == 0) || (fgintex == (fendintex - 1)) || (fgnum > 1))
          {//如果设置符在起始 或 结尾 或 多个设置符--->非法命令
               return -(fendintex + 1);//非法的完整命令
          }
          u8cmdlen = (fgintex - fstartintex);//命令长度
     }

//开始逐条比较命令
     for(s16intex = 0;s16intex < motp->cmdnum;s16intex++)
     {
          //if(u8cmdlen == CmdByteNum[s16intex])
          if(u8cmdlen == motp->mttp[s16intex].cmdl)
          {//命令长度相等
               //cp = (Cltp + s16intex)->cmdp;//提取命令列表指定命令的首地址
               cp = motp->mttp[s16intex].cmdp;//提取命令列表指定命令的首地址
               for(u8datintex = 0;u8datintex < u8cmdlen;u8datintex++)
               {//逐个数据比较
                    if(cdp[fstartintex + u8datintex] != cp[u8datintex])
                    {//不相等，退出
                         break;
                    }
               }
               if(u8datintex == u8cmdlen)
               {//数据匹配
                    vdp = 0;
                    vdl = 0;
                    if(fgnum)
                    {//如果有设置符
                         vdp = &cdp[fgintex + 1];//提取出数据首地址
                         vdl = (fendintex - fgintex - 1);//提取出数据字节数
                    }
                    //((Cltp + s16intex)->Fp)(fgnum,vdp,vdl);//执行回调函数
                    (motp->mttp[s16intex].Fp)(fgnum,vdp,vdl,pp);//执行回调函数
                    return (fendintex + 1);//有效的完整命令;
               }               
          }
     }
     
     return -(fendintex + 1);//非法的完整命令;
}

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的内部函数代码区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/




