/********************************************************************************************************************************************
*                                                                                                                                           *
*              ---------------------------------以下是模块的修改记录区-----------------------------------------                             *
*                                                                                                                                           *
********************************************************************************************************************************************/
/**********************************************
 * 内容：
 * 日期：2018-07-26
 * 作者：YJX
 * 版本号：V1.0（初版）
 ***********************************************
 * 修改内容：
 * 修改日期：
 * 修改作者：
 * 版 本 号：
 ***********************************************
*/
/********************************************************************************************************************************************
*                                                                                                                                           *
*                ---------------------------------以下是模块的使用说明区-----------------------------------------                           *
*                                                                                                                                           *
********************************************************************************************************************************************/
/*                                       特点说明：

*/

#include "FUN_ParaOPR.h"

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下模块间的对接函数区-----------------------------------------                             *
*                                                                                                                                           *
********************************************************************************************************************************************/

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块间的变量申明区--------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/


/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块内的 变量 与 宏定义 申明区--------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块内的宏定义区------------------------------------                                  *
*                                                                                                                                           *
********************************************************************************************************************************************/

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块内的变量类型定义区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的内部函数申明区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/
static u8 CalcChksum (u8 *pTab,u8 sLen,u8 rev_nr);
static u8 TestChksum(u8 *pTab,u8 sLen,u8 rev_nr);

/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的系统函数代码区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/


/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的用户函数代码区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/
/*-------------------------------------------------
函数名:FUN_ParaOPR_Read
功  能:读参数函数
参  数:
     ParaOPRType *tp:参数操作类型的结构体指针
返回值:
     小于0:读取失败
     等于0:读取成功
注  意:
     无
示  例:
作  者:YJX
版  本:V1.0
时  间:2018-01-26
-------------------------------------------------*/
s8 FUN_ParaOPR_Read(ParaOPRType *tp)
{    
     u8 *p_wrk;
     u32 addr,Para_MaxTabNum;
     s32 s32temp;
     u16 index;
     u8 j;

     Para_MaxTabNum = (tp->ParaAreaSize / tp->ParaLabSize - 1);//最大表数
     // 查找最新有效的设置表 
     index = 0;
     p_wrk = (u8 *)(tp->TabP);

     while(1)
     {
          // 读数据 
          addr = (tp->ParaAreaStarAdd + tp->ParaLabSize * index);
          s32temp = tp->ReadFunP(addr,(u8 *)(tp->TabP),tp->ParaLabSize);
          if(s32temp != tp->ParaLabSize)
          {//读取错误
               return -1;
          }
          
          // 检验和验证 
          if(TestChksum(p_wrk,tp->ParaLabSize,tp->VerNum) != 0)	
          {// 错误的设置表 
               // 恢复默认设置 
               if(index == 0)		
               {// 空
                    tp->Intex = 0;
                    // 擦除空间 
                    s32temp = tp->EraseFunP(tp->ParaAreaStarAdd,tp->ParaAreaSize);
                    if(s32temp != tp->ParaAreaSize)
                    {//擦除失败
                         return -2;
                    }
                    // 结构体内容清零 
                    for(j = 0;j < tp->ParaLabSize;j++)
                    {
                         *(p_wrk + j) = 0;
                    }
                    // 恢复默认设置 
                    tp->DefaultFunP();
                    *(tp->CheckSumP) = 0;
                    *(tp->CheckSumP) = CalcChksum((u8 *)(tp->TabP),tp->ParaLabSize,tp->VerNum);
                    // 写入空间 
                    addr = tp->ParaAreaStarAdd;
                    s32temp = tp->WriteFunP(addr,(u8 *)(tp->TabP),tp->ParaLabSize);
                    if(s32temp != tp->ParaLabSize)
                    {//写失败
                         return -3;
                    }
                    return 0;
               }
               else
               {
                    tp->Intex = index - 1;	// 获得最新的参数表索引值
                    break;
               }				
          }
          else	 
          {// 正确的设置表
               // 继续历遍设置表
               if(index >= Para_MaxTabNum)		
               {// 历遍过整个空间 
                    tp->Intex = Para_MaxTabNum;
                    break;
               }	
               index++;
          }		
     }
	
     // 读取参数值 
     addr = tp->ParaAreaStarAdd + ((tp->ParaLabSize) * (tp->Intex));
     s32temp = tp->ReadFunP(addr,(u8 *)(tp->TabP),tp->ParaLabSize);
     if(s32temp != tp->ParaLabSize)
     {//读失败
          return -1;
     }
     return 0;
}

/*-------------------------------------------------
函数名:FUN_ParaOPR_Write
功  能:写参数函数
参  数:
     ParaOPRType *tp:参数操作类型的结构体指针
返回值:
     小于0:修改失败
     等于0:修改成功
注  意:
     无
示  例:
作  者:YJX
版  本:V1.0
时  间:2018-01-26
-------------------------------------------------*/
s8 FUN_ParaOPR_Write(ParaOPRType *tp)
{
     u8 *p_wrk;
     u8 i;
     u32 addr,Para_MaxTabNum;
     s32 s32temp;
     u8 temp[ParaTableMaxSize];

     Para_MaxTabNum = (tp->ParaAreaSize / tp->ParaLabSize - 1);//最大表数

     // 计算校验和 
     *(tp->CheckSumP) = 0;
     *(tp->CheckSumP) = CalcChksum((u8 *)(tp->TabP),tp->ParaLabSize,tp->VerNum);
     	
     // 检验是否数据有变化 
     addr = (tp->ParaAreaStarAdd + tp->ParaLabSize * tp->Intex);
     s32temp = tp->ReadFunP(addr,temp,tp->ParaLabSize);//读取参数数据到temp空间里
     if(s32temp != tp->ParaLabSize)
     {//读取失败
          return -1;
     }
     // 判断是否数据有变化?如果没有变化,不保存 
     p_wrk = (u8 *)(tp->TabP);//指向参数表空间首地址
     for(i = 0; i < tp->ParaLabSize; i++)
     {
          if(*(p_wrk+i) != temp[i])
          {//如果有字节不一样，表示数据有发生变化
               break;	
          }
     }
     if(i == tp->ParaLabSize)
     {//如果比较完成，则表示数据没有发生变化，直接退出
          return 0;
     }
     //到此，表示数据发生了变化，需要将数据写入空间
     // 写入地址 
     if(tp->Intex >= Para_MaxTabNum)		//空间满了 
     {
          //擦除
          s32temp = tp->EraseFunP(tp->ParaAreaStarAdd,tp->ParaAreaSize);
          if(s32temp != tp->ParaAreaSize)
          {//擦除失败
               return -2;
          }
          tp->Intex = 0;		
     }
     else
     {
          tp->Intex++;//更新新的数据页
     }
     //判断待写入的区域是否为可写，即区域都要为0xff才行
     addr = (tp->ParaAreaStarAdd + tp->ParaLabSize * tp->Intex);
     s32temp = tp->ReadFunP(addr,temp,tp->ParaLabSize);
     if(s32temp != tp->ParaLabSize)
     {//读取失败
          return -3;
     }
     for(i = 0; i < tp->ParaLabSize;i++)
     {
          if(temp[i] != 0xff)
          {
               break;
          }
     }
     if(i != tp->ParaLabSize)
     {//表示区域为不可写区域
          //擦除
          s32temp = tp->EraseFunP(tp->ParaAreaStarAdd,tp->ParaAreaSize);
          if(s32temp != tp->ParaAreaSize)
          {//擦除失败
               return -2;
          }
          tp->Intex = 0;	
     }
     
     addr = (tp->ParaAreaStarAdd + tp->ParaLabSize * tp->Intex);
     s32temp = tp->WriteFunP(addr,(u8 *)(tp->TabP),tp->ParaLabSize);
     if(s32temp != tp->ParaLabSize)
     {//写入失败
          return -4;
     }
     return 0;
}



/********************************************************************************************************************************************
*                                                                                                                                           *
*               ----------------------------------以下是模块的内部函数代码区------------------------------------                            *
*                                                                                                                                           *
********************************************************************************************************************************************/
// 计算校验和 
static u8 CalcChksum (u8 *pTab,u8 sLen,u8 rev_nr)
{
     u32 i;
     u8 sum;  
     sum = rev_nr;
     for(i = 0;i < sLen;i++)
     {
          sum += pTab[i];
     }
     return (~sum);                        // "~sum" 是 "0xFF-sum"
}

// 返回值:非0表示错误 
static u8 TestChksum(u8 *pTab,u8 sLen,u8 rev_nr)
{
     u8 sum;
     sum = CalcChksum(pTab, sLen,rev_nr);// 计算
     return (sum);
}


